# coding=utf8

import random

def quiz():

    verbs = [
        ['ἄγω', 'ἄγεις', 'ἄγει', 'ἄγομεν', 'ἄγετε', 'ἄγουσι(ν)', 'ἄγομαι', 'ἄγῃ', 'ἄγεται', 'ἀγόμεθα', 'ἄγεσθε', 'ἄγονται', 'ἦγον', 'ἦγες', 'ἦγε(ν)', 'ἤγομεν', 'ἤγετε', 'ἦγον', 'ἠγόμην', 'ἤγου', 'ἤγετο', 'ἠγόμεθα', 'ἤγεσθε', 'ἤγοντο', 'ἄξω', 'ἄξεις', 'ἄξει', 'ἄξομεν', 'ἄξετε', 'ἄξουσι(ν)', 'ἄξομαι', 'ἄξῃ', 'ἄξεται', 'ἀξόμεθα', 'ἄξεσθε', 'ἄξονται', 'ἤγαγον', 'ἤγαγες', 'ἤγαγε(ν)', 'ἠγάγομεν', 'ἠγάγετε', 'ἤγαγον', 'ἠγαγόμην', 'ἤγαγου', 'ἠγάγετο', 'ἠγαγόμεθα', 'ἠγάγεσθε', 'ἠγάγοντο', 'ἦχα', 'ἦχας', 'ἦχε(ν)', 'ἤχαμεν', 'ἤχατε', 'ἤχασι(ν)', 'ἤχη', 'ἤχης', 'ἤχει(ν)', 'ἤχεμεν', 'ἤχετε', 'ἤχεσαν', 'ἦγμαι', 'ἦξαι', 'ἦκται', 'ἤγμεθα', 'ἦχθε', 'ἠγμένοι εἰσι(ν)', 'ἤγμην', 'ἦξο', 'ἦκτο', 'ἤγμεθα', 'ἦχθε', 'ἠγμένοι ἦσαν', 'ἦχθην', 'ἤχθης', 'ἤχθη', 'ἤχθημεν', 'ἤχθητε', 'ἤχθησαν', 'ἀχθήσομαι', 'ἀχθήσῃ/ήσει', 'ἀχθήσεται', 'ἀχθησόμεθα', 'ἀχθήσεσθε', 'ἀχθήσονται', 'ἄγω', 'ἄγῃς', 'ἄγῃ', 'ἄγωμεν', 'ἄγητε', 'ἄγωσι(ν)', 'ἄγωμαι', 'ἄγῃ', 'ἄγηται', 'ἀγώμεθα', 'ἄγησθε', 'ἄγωνται', 'ἄγοιμι', 'ἄγοις', 'ἄγοι', 'ἄγοιμεν', 'ἄγοιτε', 'ἄγοιεν', 'ἀγοίμην', 'ἄγοιο', 'ἄγοιτο', 'ἀγοίμεθα', 'ἄγοισθε', 'ἄγοιντο', 'ἄγειν', 'ἄγεσθαι', 'ἄξοιμι', 'ἄξοις', 'ἄξοι', 'ἄξοιμεν', 'ἄξοιτε', 'ἄξοιεν', 'ἀξοίμην', 'ἄξοιο', 'ἄξοιτο', 'ἀξοίμεθα', 'ἄξοισθε', 'ἄξοιντο', 'ἄξειν', 'ἄξεσθαι', 'ἀγάγω', 'ἀγάγῃς', 'ἀγάγῃ', 'ἀγάγωμεν', 'ἀγάγητε', 'ἀγάγωσι(ν)', 'ἀγάγωμαι', 'ἀγάγῃ', 'ἀγάγηται', 'ἀγαγώμεθα', 'ἀγάγησθε', 'ἀγάγωνται', 'ἀγάγοιμι', 'ἀγάγοις', 'ἀγάγοι', 'ἀγάγοιμεν', 'ἀγάγοιτε', 'ἀγάγοιεν', 'ἀγαγοίμην', 'ἀγάγοιο', 'ἀγάγοιτο', 'ἀγαγοίμεθα', 'ἀγάγοισθε', 'ἀγάγοιντο', 'ἀγαγεῖν', 'ἀγαγέσθαι', 'ἤχω', 'ἤχῃς', 'ἤχῃ', 'ἤχωμεν', 'ἤχητε', 'ἤχωσι(ν)', 'ἤχοιμι', 'ἤχοις', 'ἤχοι', 'ἤχοιμεν', 'ἤχοιτε', 'ἤχοιεν', 'ἠχέναι', 'ἦχθαι', 'ἄχθω', 'ἄχθῃς', 'ἄχθῃ', 'ἄχθωμεν', 'ἄχθητε', 'ἄχθωσι(ν)', 'ἀχθείην', 'ἀχθείης', 'ἀχθείη', 'ἀχθεῖμεν', 'ἀχθεῖτε', 'ἀχθεῖεν', 'ἀχθῆναι', 'ἀχθησοίμην', 'ἀχθήσοιο', 'ἀχθήσοιτο', 'ἀχθησοίμεθα', 'ἀχθήσοισθε', 'ἀχθήσοιντο', 'ἄγε', 'ἀγέτω', 'ἄγετε', 'ἀγόντων', 'ἄγου', 'ἀγέσθω', 'ἄγεσθε', 'ἀγέσθων', 'ἄγαγε', 'ἀγαγέτω', 'ἀγάγετε', 'ἀγαγόντων', 'ἀγαγοῦ', 'ἀγαγέσθω', 'ἀγάγεσθε', 'ἀγαγέσθων'],
        ['βαίνω', 'βαίνεις', 'βαίνει', 'βαίνομεν', 'βαίνετε', 'βαίνουσι(ν)', 'ἔβαινον', 'ἔβαινες', 'ἔβαινε(ν)', 'ἐβαίνομεν', 'ἐβαίνετε', 'ἔβαινον', 'βήσομαι', 'βήσῃ', 'βήσεται', 'βησόμεθα', 'βήσεσθε', 'βήσονται', 'ἔβην', 'ἔβης', 'ἔβη', 'ἔβημεν', 'ἔβητε', 'ἔβησαν', 'βέβηκα', 'βέβηκας', 'βέβηκε(ν)', 'βεβήκαμεν', 'βεβήκατε', 'βεβήκασι(ν)', 'ἐβεβήκη', 'ἐβεβήκης', 'ἐβεβήκει(ν)', 'ἐβεβήκεμεν', 'ἐβεβήκετε', 'ἐβεβήκεσαν', 'βαίνω', 'βαίνῃς', 'βαίνῃ', 'βαίνωμεν', 'βαίνητε', 'βαίνωσι(ν)', 'βαίνωμαι', 'βαίνῃ', 'βαίνηται', 'βαινώμεθα', 'βαίνησθε', 'βαίνωνται', 'βαίνοιμι', 'βαίνοις', 'βαίνοι', 'βαίνοιμεν', 'βαίνοιτε', 'βαίνοιεν', 'βαινοίμην', 'βαίνοιο', 'βαίνοιτο', 'βαινοίμεθα', 'βαίνοισθε', 'βαίνοιντο', 'βαίνειν', 'βαίνεσθαι', 'βησοίμην', 'βήσοιο', 'βήσοιτο', 'βησοίμεθα', 'βήσοισθε', 'βήσοιντο', 'βῶ', 'βῇς', 'βῇ', 'βῶμεν', 'βῆτε', 'βῶσι(ν)', 'βαίην', 'βαίης', 'βαίη', 'βαῖμεν', 'βαῖτε', 'βαῖεν', 'βῆναι', 'βεβήκω', 'βεβήκῃς', 'βεβήκῃ', 'βεβήκωμεν', 'βεβήκητε', 'βεβήκωσι(ν)', 'βεβήκοιμι', 'βεβήκοις', 'βεβήκοι', 'βεβήκοιμεν', 'βεβήκοιτε', 'βεβήκοιεν', 'βέβηκέναι', 'βησοίμην', 'βήσοιο', 'βήσοιτο', 'βησοίμεθα', 'βήσοισθε', 'βήσοιντο', 'βήσεσθαι', 'βαῖνε', 'βαινέτω', 'βαίνετε', 'βαινόντων', 'βαίνου', 'βαινέσθω', 'βαίνεσθε', 'βαινέσθων', 'βῆθι', 'βῆτε'],
        ['βάλλω', 'βάλλεις', 'βάλλει', 'βάλλομεν', 'βάλλετε', 'βάλλουσι(ν)', 'βάλλομαι', 'βάλλῃ', 'βάλλεται', 'βαλλόμεθα', 'βάλλεσθε', 'βάλλονται', 'ἔβαλλον', 'ἔβαλλες', 'ἔβαλλε(ν)', 'ἐβάλλομεν', 'ἐβάλλετε', 'ἔβαλλον', 'ἐβαλλόμην', 'ἐβάλλου', 'ἐβάλλετο', 'ἐβαλλόμεθα', 'ἐβάλλεσθε', 'ἐβάλλοντο', 'βαλῶ', 'βαλεῖς', 'βαλεῖ', 'βαλοῦμεν', 'βαλεῖτε', 'βαλοῦσι(ν)', 'βαλοῦμαι', 'βαλῇ', 'βαλεῖται', 'βαλούμεθα', 'βαλεῖσθε', 'βαλοῦνται', 'ἔβαλον', 'ἔβαλες', 'ἔβαλε(ν)', 'ἐβάλομεν', 'ἐβάλετε', 'ἔβαλον', 'ἐβαλόμην', 'ἐβάλου', 'ἐβάλετο', 'ἐβαλόμεθα', 'ἐβάλεσθε', 'ἐβάλοντο', 'βέβληκα', 'βέβληκας', 'βέβληκε(ν)', 'βεβλήκαμεν', 'βεβλήκατε', 'βεβλήκασι(ν)', 'ἐβεβλήκη', 'ἐβεβλήκης', 'ἐβεβλήκει(ν)', 'ἐβεβλήκεμεν', 'ἐβεβλήκετε', 'ἐβεβλήκεσαν', 'βέβλημαι', 'βέβλησαι', 'βέβληται', 'βεβλήμεθα', 'βέβλησθε', 'βέβληνται', 'ἐβεβλήμην', 'ἐβέβλησο', 'ἐβέβλητο', 'ἐβεβλήμεθα', 'ἐβέβλησθε', 'ἐβέβληντο', 'ἐβλήθην', 'ἐβλήθης', 'ἐβλήθη', 'ἐβλήθημεν', 'ἐβλήθητε', 'ἐβλήθησαν', 'βληθήσομαι', 'βληθήσῃ/ήσει', 'βληθήσεται', 'βληθησόμεθα', 'βληθήσεσθε', 'βληθήσονται', 'βάλλω', 'βάλλῃς', 'βάλλῃ', 'βάλλωμεν', 'βάλλητε', 'βάλλωσι(ν)', 'βάλλοιμι', 'βάλλοις', 'βάλλοι', 'βάλλοιμεν', 'βάλλοιτε', 'βάλλοιεν', 'βάλλειν', 'βάλλωμαι', 'βάλλῃ', 'βάλληται', 'βαλλώμεθα', 'βάλλησθε', 'βάλλωνται', 'βαλλοίμην', 'βάλλοιο', 'βάλλοιτο', 'βαλλοίμεθα', 'βάλλοισθε', 'βάλλοιντο', 'βάλλεσθαι', 'βάλοιμι', 'βάλοις', 'βάλοι', 'βάλοιμεν', 'βάλοιτε', 'βάλοιεν', 'βαλεῖν', 'βαλοίμην', 'βάλοιο', 'βάλοιτο', 'βαλοίμεθα', 'βάλοισθε', 'βάλοιντο', 'βαλεῖσθαι', 'βάλω', 'βάλῃς', 'βάλῃ', 'βάλωμεν', 'βάλητε', 'βάλωσι(ν)', 'βάλοιμι', 'βάλοις', 'βάλοι', 'βάλοιμεν', 'βάλοιτε', 'βάλοιεν', 'βαλεῖν', 'βάλωμαι', 'βάλῃ', 'βάληται', 'βαλώμεθα', 'βάλησθε', 'βάλωνται', 'βαλοίμην', 'βάλοιο', 'βάλοιτο', 'βαλοίμεθα', 'βάλοισθε', 'βάλοιντο', 'βαλέσθαι', 'βεβλήκω', 'βεβλήκῃς', 'βεβλήκῃ', 'βεβλήκωμεν', 'βεβλήκητε', 'βεβλήκωσι(ν)', 'βεβλήκοιμι', 'βεβλήκοις', 'βεβλήκοι', 'βεβλήκοιμεν', 'βεβλήκοιτε', 'βεβλήκοιεν', 'βεβληκέναι', 'βεβλῆσθαι', 'βληθῶ', 'βληθῇς', 'βληθῇ', 'βληθῶμεν', 'βληθῆτε', 'βληθῶσι(ν)', 'βληθείην', 'βληθείης', 'βληθείη', 'βληθεῖμεν', 'βληθεῖτε', 'βληθεῖεν', 'βληθῆναι', 'βληθησοίμην', 'βληθήσοιο', 'βληθήσοιτο', 'βληθησοίμεθα', 'βληθήσοισθε', 'βληθήσοιντο', 'βληθήσεσθαι', 'βάλλε', 'βαλλέτω', 'βάλλετε', 'βαλλόντων', 'βάλλου', 'βαλλέσθω', 'βάλλεσθε', 'βαλλέσθων', 'βάλε', 'βαλέτω', 'βάλετε', 'βαλόντων', 'βαλοῦ', 'βαλέσθω', 'βάλεσθε', 'βαλέσθων'],
        ['δίδωμι', 'δίδως', 'δίδωσι', 'δίδομεν', 'δίδοτε', 'διδόασι', 'διδῶ', 'διδῷς', 'διδῷ', 'διδῶμεν', 'διδῶτε', 'διδῶσι', 'διδοίην', 'διδοίης', 'διδοίη', 'διδοῖμεν', 'διδοῖτε', 'διδοῖεν', 'διδόναι', 'δίδου', 'δίδοτε', 'δίδομαι', 'δίδοσαι', 'δίδοται', 'διδόμεθα', 'δίδοσθε', 'δίδονται', 'διδῶμαι', 'διδῷ', 'διδῶται', 'διδώμεθα', 'διδῶσθε', 'διδῶνται', 'διδοίμην', 'διδοιο', 'διδοιτο', 'διδοίμεθα', 'διδοισθε', 'διδοιντο', 'δίδοσθαι', 'δίδοσο', 'δίδοσθε', 'ἐδίδουν', 'ἐδίδους', 'ἐδίδου', 'ἐδίδομεν', 'ἐδίδοτε', 'ἐδίδοσαν', 'ἐδιδόμην', 'ἐδίδοσο', 'ἐδίδοτο', 'ἐδιδόμεθα', 'ἐδίδοσθε', 'ἐδίδοντο', 'δώσω', 'δώσεις', 'δώσει', 'δώσομεν', 'δώσετε', 'δώσουσι(ν)', 'δώσοιμι', 'δώσοις', 'δώσοι', 'δώσοιμεν', 'δώσοιτε', 'δώσοιεν', 'δώσειν', 'δώσομαι', 'δώσῃ', 'δώσεται', 'δωσόμεθα', 'δώσεσθε', 'δώσονται', 'δωσοίμην', 'δώσοιο', 'δώσοιτο', 'δωσοίμεθα', 'δώσοισθε', 'δώσοιντο', 'δώσεσθαι', 'ἔδωκα', 'ἔδωκας', 'ἔδωκα', 'ἔδομεν', 'ἔδοτε', 'ἔδωκαν', 'δῶ', 'δῷς', 'δῷ', 'δῶμεν', 'δῶτε', 'δῶσι', 'δοίην', 'δοίης', 'δοίη', 'δοῖμεν', 'δοῖτε', 'δοῖεν', 'δοῦναι', 'δός', 'δότε', 'δῶμαι', 'δῷ', 'δῶται', 'δώμεθα', 'δῶσθε', 'δῶνται', 'ἐδόμην', 'ἔδου', 'ἔδοτο', 'ἐδόμεθα', 'ἔδοσθε', 'ἔδοντο', 'δοίμην', 'δοῖο', 'δοῖτο', 'δοίμεθα', 'δοῖσθε', 'δοῖντο', 'δόσθαι', 'δοῦ', 'δόσθε', 'δέδωκα', 'δέδωκας', 'δέδωκε(ν)', 'δεδώκαμεν', 'δεδώκατε', 'δεδώκασι(ν)', 'δεδώκω', 'δεδώκῃς', 'δεδώκῃ', 'δεδώκωμεν', 'δεδώκητε', 'δεδώκωσι(ν)', 'δεδώκοιμι', 'δεδώκοις', 'δεδώκοι', 'δεδώκοιμεν', 'δεδώκοιτε', 'δεδώκοιεν', 'δεδωκέναι', 'ἐδεδώκη', 'ἐδεδώκης', 'ἐδεδώκει(ν)', 'ἐδεδώκεμεν', 'ἐδεδώκετε', 'ἐδεδώκεσαν', 'δέδομαι', 'δέδοσαι', 'δέδοται', 'δεδόμεθα', 'δέδοσθε', 'δέδονται', 'δεδόσθαι', 'ἐδεδόμην', 'ἐδέδοσο', 'ἐδέδοτο', 'ἐδεδόμεθα', 'ἐδέδοσθε', 'ἐδέδοντο', 'ἐδόθην', 'ἐδόθης', 'ἐδόθη', 'ἐδόθημεν', 'ἐδόθητε', 'ἐδόθησαν', 'δοθῶ', 'δοθῇς', 'δοθῇ', 'δοθῶμεν', 'δοθῆτε', 'δοθῶσι(ν)', 'δοθείην', 'δοθείης', 'δοθείη', 'δοθεῖμεν', 'δοθεῖτε', 'δοθεῖεν', 'δοθῆναι', 'δοθήσομαι', 'δοθήσῃ/ήσει', 'δοθήσεται', 'δοθησόμεθα', 'δοθήσεσθε', 'δοθήσονται', 'δοθησοίμην', 'δοθήσοιο', 'δοθήσοιτο', 'δοθησοίμεθα', 'δοθήσοισθε', 'δοθήσοιντο', 'δοθήσεσθαι'],
        ['ἔρχομαι', 'ἔρχῃ', 'ἔρχεται', 'ἐρχόμεθα', 'ἔρχεσθε', 'ἔρχονται', 'ἔρχωμαι', 'ἔρχῃ', 'ἔρχηται', 'ἐρχώμεθα', 'ἔρχησθε', 'ἔρχωνται', 'ἐρχοίμην', 'ἔρχοιο', 'ἔρχοιτο', 'ἐρχοίμεθα', 'ἔρχοισθε', 'ἔρχοιντο', 'ἔρχεσθαι', 'ἔρχοσο', 'ἔρχοσθε', 'ἠρχόμην', 'ἤρχου', 'ἤρχετο', 'ἠρχόμεθα', 'ἤρχεσθε', 'ἤρχοντο', 'ἐλεύσομαι', 'ἐλεύσῃ', 'ἐλεύσεται', 'ἐλευσόμεθα', 'ἐλεύσεσθε', 'ἐλεύσονται', 'ἐλεοίμην', 'ἐλεύσοιο', 'ἐλεύσοιτο', 'ἐλεοίμεθα', 'ἐλεύσοισθε', 'ἐλεύσοιντο', 'ἐλεύσεσθαι', 'ἦλθον', 'ἦλθες', 'ἦλθε(ν)', 'ἤλθομεν', 'ἤλθετε', 'ἦλθον', 'ἔλθω', 'ἔλθῃς', 'ἔλθῃ', 'ἔλθωμεν', 'ἔλθητε', 'ἔλθωσι(ν)', 'ἔλθοιμι', 'ἔλθοις', 'ἔλθοι', 'ἔλθοιμεν', 'ἔλθοιτε', 'ἔλθοιεν', 'ἐλθεῖν', 'ἐλθέ', 'ἔλθετε', 'ἐλήλυθα', 'ἐλήλυθας', 'ἐλήλυθε(ν)', 'ἐληλύθαμεν', 'ἐληλύθατε', 'ἐληλύθασι(ν)', 'ἐληλύθω', 'ἐληλύθῃς', 'ἐληλύθῃ', 'ἐληλύθωμεν', 'ἐληλύθητε', 'ἐληλύθωσι(ν)', 'ἐληλύθοιμι', 'ἐληλύθοις', 'ἐληλύθοι', 'ἐληλύθοιμεν', 'ἐληλύθοιτε', 'ἐληλύθοιεν', 'ἐληλύθέναι', 'ἠληλύθη', 'ἠληλύθης', 'ἠληλύθει(ν)', 'ἠληλύθεμεν', 'ἠληλύθετε', 'ἠληλύθεσαν'],
        ['ἔχω', 'ἕξω', 'ἔσχον', 'ἔσχηκα', None, None],
        ['ἵστημι', 'στήσω', 'ἔστην/ἔστησα', 'ἕστηκα', 'ἕσταμαι', 'ἐστάθην'],
        ['ὁράω', 'ὄψομαι', 'εἶδον', 'ἑώρακα', 'ὦμμαι', 'ὤφθην'],
        ['τίθημι', 'θήσω', 'ἔθηκα', 'τέθεικα', 'τέθειμαι', 'ἐτέθην'],
        ['φημί', 'φήσω', 'ἔφησα', None, None, None]
    ]

    verbs = random.sample(verbs, len(verbs))

    no_of_questions = input('How many verbs would you like to quiz yourself on? --> ')

    while int(no_of_questions) > len(verbs):
        no_of_questions = input('You can choose up to ' + str(len(verbs)) + ' verbs. Choose again! --> ')

    incorrect = []
    correct = []
    for verb in verbs[0:int(no_of_questions)]:

        form = verb[random.randint(1,int(len(verb)-1))]

        while form == None:
            form = verb[random.randint(1,int(len(verb)-1))]

        answer = input('What is the first principal part of ' + form + '? --> ')

        while answer != verb[0]:
            if answer == 'I give up.':
                print('οἴμοι! The correct answer is ' + str(verb[0]) + '.')
                if verb[0] not in incorrect:
                    incorrect.append(verb[0])
                break
            else:
                if verb[0] not in incorrect:
                    incorrect.append(verb[0])
                answer = input('οἴμοι! Try again! --> ')
        else:
            print('εὖγε!')
            
            if verb[0] not in incorrect:
                correct.append(verb[0])
            pass

    if incorrect == []:
        print("You got them all right! ",str(set(correct)))
    else:
        print("You need to brush up on the following verbs: ",str(set(incorrect)))
        print("You got the following verbs correct: ",str(set(correct)))

quiz()
